src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_РасположенияИБ/бир_РасположенияИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_РасположенияИБ</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаРасположения</name>
    <type>
      <types>CatalogRef.бир_НастройкиРасположенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокСистемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьЗаголовокСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСообщениеПользователю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияПользователю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/CommonModules/бир_РасположениеИБВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - возвращает описание текущего расположения информационной базы
//
// Возвращаемое значение:
//   СправочникСсылка.бир_РасположенияИБ    - текущее расположение информационной базы
//
Функция ТекущееРасположениеИБ() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.бир_ТекущееРасположениеИБ;
	
КонецФункции // ТекущееРасположениеИБ()

// Функция - возвращает описание последнего сохраненного расположения информационной базы
//
// Возвращаемое значение:
//   СправочникСсылка.бир_РасположенияИБ    - текущее расположение информационной базы
//
Функция ПоследнееРасположениеИБ() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.бир_ПоследнееРасположениеИБ.Получить();
	
КонецФункции // ПоследнееРасположениеИБ()

// Процедура - устанавливает текущее расположения информационной базы
//
// Параметры:
//   ТекущееРасположение    - СправочникСсылка.бир_РасположенияИБ    - текущее расположение информационной базы
//
Процедура ОбновитьТекущееРасположениеИБ(Знач ТекущееРасположение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Константы.бир_ПоследнееРасположениеИБ.Установить(ТекущееРасположение);
	ПараметрыСеанса.бир_ТекущееРасположениеИБ = ТекущееРасположение;

	Если ТекущееРасположение.Пустая() Тогда
		ТекущееРасположение = Справочники.бир_РасположенияИБ.ПоУмолчанию;
	КонецЕсли;
		
	ОбработатьПользователей(ТекущееРасположение.НастройкаРасположения);
	
	ОбработатьРасширения(ТекущееРасположение.НастройкаРасположения);

	ОбработатьРегламентныеЗадания(ТекущееРасположение.НастройкаРасположения);

	ВыполнитьОбновлениеНумерацииОбъектов(ТекущееРасположение.НастройкаРасположения);

	ОбработатьПроизвольныйКод(ТекущееРасположение.НастройкаРасположения);

КонецПроцедуры // ОбновитьТекущееРасположениеИБ()

// Процедура - обновляет текущее расположение ИБ и устанавливает главный стиль приложения
//
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "бир_ТекущееРасположениеИБ" Тогда
		ПараметрыСеанса.бир_ТекущееРасположениеИБ = НовоеРасположениеИБ();
		УстановленныеПараметры.Добавить("бир_ТекущееРасположениеИБ");
	КонецЕсли;

	Если НЕ ПоследнееРасположениеИБ() = ТекущееРасположениеИБ() Тогда
		ОбновитьТекущееРасположениеИБ(ТекущееРасположениеИБ());
	КонецЕсли;

	УстановитьГлавныйСтиль(ТекущееРасположениеИБ());
	
КонецПроцедуры // УстановкаПараметровСеанса()

// Функция - проверяет необходимость вывода сообщения пользователю при смене расположения ИБ
//
// Параметры:
//   ТекстСообщения    - Строка    - (возвр.) текст сообщения пользователю
//
// Возвращаемое значение:
//   Булево    - Истина - требуется выводить сообщение пользователю
//
Функция ВыводитьСообщениеПользователюОТекущемРасположенииИБ(ТекстСообщения = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ТекущееРасположение = ТекущееРасположениеИБ();
	Если ТекущееРасположение.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	Если ТекущееРасположение.ВыводитьСообщениеПользователю Тогда
		ТекстСообщения = ТекущееРасположение.ТекстСообщенияПользователю;
		Результат = Истина;
	ИначеЕсли ТекущееРасположение.НастройкаРасположения.ВыводитьСообщениеПользователю Тогда
		ТекстСообщения = ТекущееРасположение.НастройкаРасположения.ТекстСообщенияПользователю;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ВыводитьСообщениеПользователюОТекущемРасположенииИБ()

// Функция - проверяет необходимость изменения заголовка главного окна
//
// Параметры:
//   Заголовок    - Строка    - (возвр.) текст заголовка главного окна
//
// Возвращаемое значение:
//   Булево    - Истина - требуется установить текст заголовка главного окна
//
Функция УстанавливатьЗаголовокСистемы(Заголовок = "") Экспорт
	
	ТекущееРасположение = ТекущееРасположениеИБ();
    Если ТекущееРасположение.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	Если ТекущееРасположение.УстановитьЗаголовокСистемы Тогда
		Заголовок = ТекущееРасположение.ЗаголовокСистемы;
		Результат = Истина;
	ИначеЕсли ТекущееРасположение.НастройкаРасположения.УстановитьЗаголовокСистемы Тогда
		Заголовок = ТекущееРасположение.НастройкаРасположения.ЗаголовокСистемы;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // УстанавливатьЗаголовокСистемы()

// Функция - возвращает версию системы
//
// Возвращаемое значение:
//   Строка    - версия системы
//
Функция ВерсияСистемы() Экспорт
	
	Возврат бир_ОбновлениеИнформационнойБазы.ВерсияБиблиотеки();
	
КонецФункции // ВерсияСистемы()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Извлекает из строки соединения с информационной базой параметры подключения
// и передает параметры в структуру для установки внешнего соединения.
//
// Параметры:
//   СтрокаСоединения    - Строка    - строка соединения с информационной базой
//
// Возвращаемое значение:
//   Структура - параметры подключения к информационной базе
//	   *ТипБазы
//	   *КаталогБазы
//	   *ИмяСервера
//	   *ИмяБазы
//	   *АутентификацияОперационнойСистемы
//	   *ИмяПользователя
//	   *ПарольПользователя
//
Функция ПараметрыПодключенияИзСтрокиСоединенияИБ(Знач СтрокаСоединения) Экспорт
	
	Возврат бир_РасположениеИБКлиентСервер.ПараметрыПодключенияИзСтрокиСоединенияИБ(СтрокаСоединения);

КонецФункции // ПараметрыПодключенияИзСтрокиСоединенияИБ()

// Функция - возвращает имя текущего сервера
//
// Возвращаемое значение:
//   Строка    - имя сервера
//
Функция ИмяСервера() Экспорт

	Возврат ИмяКомпьютера();

КонецФункции // ИмяСервера()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - определяет и возвращает описание нового расположения информационной базы
//
// Возвращаемое значение:
//   СправочникСсылка.бир_РасположенияИБ    - новое расположение информационной базы
//
Функция НовоеРасположениеИБ()
	
	ТипыБаз = бир_РасположениеИБКлиентСервер.ТипыБаз();

	ПараметрыПодключения =
		ПараметрыПодключенияИзСтрокиСоединенияИБ(СтрокаСоединенияИнформационнойБазы());
	
	РасположениеИБ = Справочники.бир_РасположенияИБ.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&ТипБазы КАК ТипБазы,
	                      |	&ИмяСервера КАК ИмяСервера,
	                      |	&ИмяБазы КАК ИмяБазы
	                      |ПОМЕСТИТЬ ВТТекущееРасположение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	РасположенияИБ.Ссылка КАК Ссылка,
	                      |	РасположенияИБ.ТипБазы КАК ТипБазы,
	                      |	РасположенияИБ.ИмяСервера КАК ИмяСервера,
	                      |	РасположенияИБ.ИмяБазы КАК ИмяБазы,
	                      |	ВЫБОР
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыСерверная
	                      |				И НЕ РасположенияИБ.ИмяСервера = """"
	                      |				И НЕ РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 0
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыФайловая
	                      |				И НЕ РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 0
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыСерверная
	                      |				И НЕ РасположенияИБ.ИмяСервера = """"
	                      |				И РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 1
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыНеУказан
	                      |				И НЕ РасположенияИБ.ИмяСервера = """"
	                      |				И НЕ РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 2
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыНеУказан
	                      |				И НЕ РасположенияИБ.ИмяСервера = """"
	                      |				И РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 3
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыСерверная
	                      |				И РасположенияИБ.ИмяСервера = """"
	                      |				И НЕ РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 4
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыНеУказан
	                      |				И РасположенияИБ.ИмяСервера = """"
	                      |				И НЕ РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 5
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыФайловая
	                      |				И РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 6
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыСерверная
	                      |				И РасположенияИБ.ИмяСервера = """"
	                      |				И РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 6
	                      |		КОГДА РасположенияИБ.ТипБазы = &ТипБазыНеУказан
	                      |				И РасположенияИБ.ИмяСервера = """"
	                      |				И РасположенияИБ.ИмяБазы = """"
	                      |			ТОГДА 10
	                      |		ИНАЧЕ 999
	                      |	КОНЕЦ КАК Приоритет
	                      |ПОМЕСТИТЬ ВТНастройкиРасположения
	                      |ИЗ
	                      |	Справочник.бир_РасположенияИБ КАК РасположенияИБ
	                      |ГДЕ
	                      |	НЕ РасположенияИБ.ПометкаУдаления
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ЕСТЬNULL(НастройкиРасположения.Ссылка, ЗНАЧЕНИЕ(Справочник.бир_РасположенияИБ.ПустаяСсылка)) КАК Ссылка,
	                      |	ЕСТЬNULL(НастройкиРасположения.Приоритет, 999) КАК Приоритет
	                      |ИЗ
	                      |	ВТТекущееРасположение КАК ТекущееРасположение
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиРасположения КАК НастройкиРасположения
	                      |		ПО (ТекущееРасположение.ТипБазы = НастройкиРасположения.ТипБазы
	                      |					И ТекущееРасположение.ИмяСервера = НастройкиРасположения.ИмяСервера
	                      |					И ТекущееРасположение.ИмяБазы = НастройкиРасположения.ИмяБазы
	                      |				ИЛИ ТекущееРасположение.ТипБазы = НастройкиРасположения.ТипБазы
	                      |					И ТекущееРасположение.ИмяСервера = НастройкиРасположения.ИмяСервера
	                      |					И НастройкиРасположения.ИмяБазы = """"
	                      |				ИЛИ ТекущееРасположение.ТипБазы = НастройкиРасположения.ТипБазы
	                      |					И НастройкиРасположения.ИмяСервера = """"
	                      |					И ТекущееРасположение.ИмяБазы = НастройкиРасположения.ИмяБазы
	                      |				ИЛИ ТекущееРасположение.ТипБазы = НастройкиРасположения.ТипБазы
	                      |					И НастройкиРасположения.ИмяСервера = """"
	                      |					И НастройкиРасположения.ИмяБазы = """"
	                      |				ИЛИ НастройкиРасположения.ТипБазы = &ТипБазыНеУказан
	                      |					И ТекущееРасположение.ИмяСервера = НастройкиРасположения.ИмяСервера
	                      |					И ТекущееРасположение.ИмяБазы = НастройкиРасположения.ИмяБазы
	                      |				ИЛИ НастройкиРасположения.ТипБазы = &ТипБазыНеУказан
	                      |					И ТекущееРасположение.ИмяСервера = НастройкиРасположения.ИмяСервера
	                      |					И НастройкиРасположения.ИмяБазы = """"
	                      |				ИЛИ НастройкиРасположения.ТипБазы = &ТипБазыНеУказан
	                      |					И НастройкиРасположения.ИмяСервера = """"
	                      |					И ТекущееРасположение.ИмяБазы = НастройкиРасположения.ИмяБазы
	                      |				ИЛИ НастройкиРасположения.ТипБазы = &ТипБазыНеУказан
	                      |					И НастройкиРасположения.ИмяСервера = """"
	                      |					И НастройкиРасположения.ИмяБазы = """")
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Приоритет");
	
	Запрос.УстановитьПараметр("ТипБазы"         , ПараметрыПодключения.ТипБазы);
	Запрос.УстановитьПараметр("ТипБазыНеУказан" , ТипыБаз.НеУказан);
	Запрос.УстановитьПараметр("ТипБазыСерверная", ТипыБаз.Серверная);
	Запрос.УстановитьПараметр("ТипБазыФайловая" , ТипыБаз.Файловая);
	Запрос.УстановитьПараметр("ИмяСервера"      , ПараметрыПодключения.АдресСервера);
	
	Если ПараметрыПодключения.ТипБазы = ТипыБаз.Серверная Тогда
		Запрос.УстановитьПараметр("ИмяБазы"   , ПараметрыПодключения.ИмяБазы);
	ИначеЕсли ПараметрыПодключения.ТипБазы = ТипыБаз.Файловая Тогда
		Запрос.УстановитьПараметр("ИмяБазы"   , ПараметрыПодключения.КаталогБазы);
	Иначе
		Запрос.УстановитьПараметр("ИмяБазы"   , Неопределено);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РасположениеИБ = Выборка.Ссылка;

	КонецЕсли;
	
	Возврат РасположениеИБ;
	
КонецФункции // НовоеРасположениеИБ()

// Функция - получает главный стиль приложения для указанного расположения ИБ
//
// Параметры:
//   РасположениеИБ         - СправочникСсылка              - настройка расположения ИБ
//                            .бир_НастройкиРасположенияИБ    или расположение ИБ.
//                            СправочникСсылка                Если не указано, берется значение из
//                            .бир_РасположенияИБ             Константы.бир_ПоследнееРасположениеИБ
//   ПолучитьПредставление  - Булево                - Истина - будет возвращено представление метаданного стиля
//                                                      Ложь - будет возвращено имя главного стиля,
//                                                      как оно указано в настройке
//
// Параметры:
//   Строка    - имя главного стиля для указанного расположения ИБ
//
Функция ГлавныйСтильРасположенияИБ(Знач РасположениеИБ = Неопределено, ПолучитьПредставление = Истина) Экспорт

	Если НЕ ЗначениеЗаполнено(РасположениеИБ) Тогда
		РасположениеИБ = Константы.бир_ПоследнееРасположениеИБ.Получить().НастройкаРасположения;
	ИначеЕсли ТипЗнч(РасположениеИБ) = Тип("СправочникСсылка.бир_РасположенияИБ") Тогда
		РасположениеИБ = РасположениеИБ.НастройкаРасположения;
	КонецЕсли;
	
	Результат = РасположениеИБ.ГлавныйСтиль;
	
	МетаГлавныйСтиль = Метаданные.Стили.Найти(Результат);
	
	Если ПолучитьПредставление И НЕ МетаГлавныйСтиль = Неопределено Тогда
		Результат = МетаГлавныйСтиль.Представление();
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ГлавныйСтильРасположенияИБ()

// Функция - определяет, что главный стиль был изменен по сравнению
// с главным стилем указанной настройки последнего расположения ИБ
//
// Параметры:
//   НастройкаРасположения  - СправочникСсылка              - настройка расположения ИБ.
//                            .бир_НастройкиРасположенияИБ    Если не указано, берется значение из
//                                                            Константы.бир_ПоследнееРасположениеИБ
//   ГлавныйСтиль           - Строка                        - имя проверяемого главного стиля
//                            СправочникСсылка                или новое расположение ИБ
//                            .бир_НастройкиРасположенияИБ    или новая настройка расположения ИБ.
//                            СправочникСсылка                Если не указано, берется значение из
//                            .бир_РасположенияИБ             Константы.бир_ПоследнееРасположениеИБ
//
// Параметры:
//   БУлево    - Истина - главный стиль изменен
//
Функция ГлавныйСтильИзменен(Знач НастройкаРасположения = Неопределено, Знач ГлавныйСтиль = Неопределено) Экспорт

	ПоследнееРасположениеИБ = Константы.бир_ПоследнееРасположениеИБ.Получить();
	
	Если НЕ ЗначениеЗаполнено(НастройкаРасположения) Тогда
		НастройкаРасположения = ПоследнееРасположениеИБ.НастройкаРасположения;
	КонецЕсли;
	
	Если ПоследнееРасположениеИБ.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГлавныйСтиль) Тогда
		ГлавныйСтиль = ПоследнееРасположениеИБ.НастройкаРасположения.ГлавныйСтиль;
	ИначеЕсли ТипЗнч(ГлавныйСтиль) = Тип("СправочникСсылка.бир_НастройкиРасположенияИБ") Тогда
		ГлавныйСтиль = ГлавныйСтиль.ГлавныйСтиль;
	ИначеЕсли ТипЗнч(ГлавныйСтиль) = Тип("СправочникСсылка.бир_РасположенияИБ") Тогда
		ГлавныйСтиль = ГлавныйСтиль.НастройкаРасположения.ГлавныйСтиль;
	КонецЕсли;

	Возврат (ПоследнееРасположениеИБ.НастройкаРасположения = НастройкаРасположения
	         И НЕ ВРег(НастройкаРасположения.ГлавныйСтиль) = ВРег(ГлавныйСтиль));

КонецФункции // ГлавныйСтильИзменен()

// Процедура - устанавливает главный стиль приложения для цветовой диференциации
//
// Параметры:
//   ТекущееРасположение    - СправочникСсылка.бир_РасположенияИБ    - текущее расположение информационной базы
//
Процедура УстановитьГлавныйСтиль(ТекущееРасположение)
	
	ТекСтиль = Метаданные.Стили.Найти(ТекущееРасположение.НастройкаРасположения.ГлавныйСтиль);
	
	Если ТекСтиль = Неопределено ИЛИ ВРег(ТекущееРасположение.НастройкаРасположения.ГлавныйСтиль) = "ОСНОВНОЙ" Тогда
		ТекСтиль = Новый Стиль();
	Иначе
		ТекСтиль = БиблиотекаСтилей[ТекСтиль.Имя];
	КонецЕсли;
	
	Если НЕ ГлавныйСтиль = ТекСтиль Тогда
		ГлавныйСтиль = ТекСтиль;
	КонецЕсли;
	
КонецПроцедуры // УстановитьГлавныйСтиль()

// Выполняет обновление нумерации объектов в соответствии с настройками для текущего расположения
//
// Параметры:
//   НастройкиРасположения    - СправочникСсылка.бир_НастройкиРасположенияИБ    - настройки расположение ИБ
//
Процедура ВыполнитьОбновлениеНумерацииОбъектов(НастройкиРасположения)
	
	Если НЕ НастройкиРасположения.ОбновитьНумерациюОбъектов Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНумерациюОбъектов();
	
КонецПроцедуры // ВыполнитьОбновлениеНумерацииОбъектов()

// Выполняет изменение пользователей в соответствии с настройками для текущего расположения
//
// Параметры:
//   НастройкиРасположения    - СправочникСсылка.бир_НастройкиРасположенияИБ    - настройки расположение ИБ
//
Процедура ОбработатьПользователей(НастройкиРасположения)
	
	//Сбрасываем параметры пользователей
	Для Каждого ТекСтрокаПользователя Из НастройкиРасположения.ПараметрыПользователей Цикл
		
		ИД = ТекСтрокаПользователя.Пользователь.ИдентификаторПользователяИБ;
		ТекПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИД);
		
		Если ТекПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекПользовательИБИзменен = Ложь;
		
		Если ТекСтрокаПользователя.СброситьПароль Тогда
			ТекПользовательИБ.АутентификацияСтандартная	= Истина;
			ТекПользовательИБ.Пароль					= "";
			ТекПользовательИБ.ЗапрещеноИзменятьПароль	= Ложь;
			
			ТекПользовательИБИзменен = Истина;
		КонецЕсли;
		
		Если ТекСтрокаПользователя.СброситьПользователяОС Тогда
			ТекПользовательИБ.АутентификацияСтандартная = Истина;
			ТекПользовательИБ.АутентификацияОС = Ложь;
			
			ТекПользовательИБИзменен = Истина;
		КонецЕсли;
		
		Если ТекПользовательИБИзменен Тогда
			ТекПользовательИБ.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбработатьПользователей()

// Выполняет включение/отключение регламентных заданий
// в соответствии с настройками для текущего расположения
//
// Параметры:
//   НастройкиРасположения    - СправочникСсылка.бир_НастройкиРасположенияИБ    - настройки расположение ИБ
//
Процедура ОбработатьРегламентныеЗадания(НастройкиРасположения)
	
	Для Каждого ТекНастройка Из НастройкиРасположения.НастройкаРегламентныхЗаданий Цикл
		Если Метаданные.РегламентныеЗадания.Найти(ТекНастройка.Задание) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", ТекНастройка.Задание));
		
		Для Каждого ТекЗадание Из НаборЗаданий Цикл
			ТекЗадание.Использование = ТекНастройка.Действие;
			ТекЗадание.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ОбработатьРегламентныеЗадания()

// Выполняет изменение параметров расширений "Активность", "БезопасныйРежим", "ЗащитаОтОпасныхДействий"
// в соответствии с настройками для текущего расположения
//
// Параметры:
//   НастройкиРасположения    - СправочникСсылка.бир_НастройкиРасположенияИБ    - настройки расположение ИБ
//
Процедура ОбработатьРасширения(НастройкиРасположения)
	
	Для Каждого ТекНастройка Из НастройкиРасположения.НастройкаРасширений Цикл
		НаборРасширений = РасширенияКонфигурации.Получить(Новый Структура("Имя", ТекНастройка.Расширение));
		Если НаборРасширений.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекРасширение Из НаборРасширений Цикл
			ТекРасширение.Активно                                                 = ТекНастройка.Активность;
			ТекРасширение.БезопасныйРежим                                         = ТекНастройка.БезопасныйРежим;
			ТекРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = ТекНастройка.ЗащитаОтОпасныхДействий;
			ТекРасширение.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ОбработатьРасширения()

// Выполняет произвольный код заданный в настройках для текущего расположения
//
// Параметры:
//   НастройкиРасположения    - СправочникСсылка.бир_НастройкиРасположенияИБ    - настройки расположение ИБ
//
Процедура ОбработатьПроизвольныйКод(НастройкиРасположения)
	
	Для Каждого ТекСтрокаКода Из НастройкиРасположения.ПроизвольныйКодПриСменеРасположения Цикл
		Если НЕ ТекСтрокаКода.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Выполнить(ТекСтрокаКода.Код);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтрШаблон("Ошибка выполнения произвольного кода:%1%2%1
			                        |текст ошибки:%1%3%1
									|действия ""%4"" настройки расположения ""%5"".",
			                        Символы.ПС,
									ТекСтрокаКода.Код,
									ТекстОшибки,
			                        ТекСтрокаКода.ИмяДействия,
			                        НастройкиРасположения);
			ЗаписьЖурналаРегистрации("РасположениеИБ.ПроизвольныйКод",
			                         УровеньЖурналаРегистрации.Ошибка,
									 НастройкиРасположения.Метаданные(),
									 НастройкиРасположения,
									 Комментарий);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // ОбработатьПроизвольныйКод()

#КонецОбласти
